/*==============================================================================

 * 功能 : 数据库基本定义

 * 模块 : 数据库基本定义

==============================================================================*/
#ifndef	_PDT_DATABASE_DBDEF_H_
#define	_PDT_DATABASE_DBDEF_H_
//---------------------------------------------------------------------------------------
#define	PDT_DB_SELECT_STEP		1000			//取数步长

namespace	PDT
{
	namespace	DB
	{
		//表类型
		enum	TableType
		{
			TT_Tables = 0x01,
			TT_SystemTables = 0x02,
			TT_Views = 0x04,
			TT_AllTables = 0xff
		};
	}
}
//---------------------------------------------------------------------------------------
#endif
